#+title: Blogging with emacs and org-mode
#+tags: emacs, Jekyll, Static
#+options: toc:nil num:nil tex:t LaTeX:t
#+latex_header_extra: \usepackage{showexpl, url, tikz, xcolor}

I do most of my work in =emacs= and blogging is no
exception. But, everytime I start a blog post, I go through a small
learning curve around the tools I use. I am going to put an end to it,
once and for all :)

** Source blocks
Source code blocks are delimited by =#+BEGIN_SRC lang= and
=#+END_SRC=. =emacs= evaluates the source block and uses the result in
export. Source block parameters, =:results= and =:exports= are
particularly useful in this context.

=:results= can have the following options specified.

collection is either =value= or =output=. The first option instructs
  =org-mode= to capture the return value of evaluation and use it in
  exporting. The second option causes any output written to =STDOUT=
  to be used as the value of the source block.

type is one of =table, vector=, =list=, =scalar=, =verbatim= or
  =file=.  By default, result is handled as a =table= or =scalar=
  depending on the value. Results of type =scalar= or =verbatim= are
  not converted to tables. A result type of =file= points to the file
  where the result is stored and causes a file link to be inserted.

format is one of:
 - =raw= results are inserted directly into the buffer
 - =org= results are enclosed in a =#+BEGIN_SRC org= block
 - =html= results are assumed to be =HTML= and enclosed in a =#+BEGIN_SRC html= block
 - =latex= results assumed to be LaTeX and are enclosed in a BEGIN_LaTeX block
 - =code= result are assumed to be parsable code and are enclosed in a code block
 - =pp= result is converted to pretty-printed code and is enclosed in a code block.
 - =drawer= result is wrapped in a RESULTS drawer

handling is one of
 - =silent= results are not inserted into the buffer
 - =replace= any existing value is replaced with value
 - =append= result is appended to existing
 - =prepend= reslult is prepended to existing

=:exports= can have one of the following values.
- =code= body of source block is inserted into the buffer
- =results= result of source block evaluation is inserted into the buffer
- =both= code and results are inserted into the buffer
- =none= neither code nor results are inserted into the buffer

Here is a Python source code block which exports code and results.

#+BEGIN_EXAMPLE
#+BEGIN_SRC python :results value :exports both
# A simple Python source block
return 42
#+END_SRC
#+END_EXAMPLE

#+BEGIN_SRC python :results value :exports both
# A simple Python source block
return 42
#+END_SRC

#+RESULTS:
: 42

Here is another Python source block whose output is captured and only the results is exported.

#+BEGIN_EXAMPLE
#+BEGIN_SRC python :results output :exports results
print "Hello, world!"
return 42
#+END_SRC
#+END_EXAMPLE

#+BEGIN_SRC python :results output :exports results
print "Hello, world!"
#+END_SRC

#+RESULTS:

#+BEGIN_SRC bash :exports none :results silent
netsh interface portproxy add v4tov4 listenaddress=127.0.0.1 listenport=5555 connectaddress=127.0.0.1 connectport=5552
netsh interface portproxy show all
netsh interface portproxy delete v4tov4 listenport=5555 listenaddress=127.0.0.1
#+END_SRC

